#include <iostream>
#include <Windows.h>
#include <string>
using namespace std;
enum ConsoleColor
{

	Green = 2,
	LightYellow = 14

};

void SetColor(int text, int background)
{
	HANDLE hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	SetConsoleTextAttribute(hStdOut, (WORD)((background << 4) | text));
}


int main()
{
	setlocale(LC_ALL, "Russian");
START:
	char x;
	float S, s1 = 0, s2 = 0, s3 = 0, s4 = 0, s5 = 0, s6 = 0, s7 = 0, s8 = 0, s9 = 0, s10 = 0, s11 = 0, s12 = 0, s13 = 0, s14 = 0, s15 = 0, s16 = 0, s17 = 0, s18 = 0, s19 = 0, s20 = 0;
	float f1 = 0, f2 = 0, f3 = 0, f4 = 0, f5 = 0, f6 = 0, f7 = 0, f8 = 0, f9 = 0, f10 = 0, f11 = 0, f12 = 0, f13 = 0, f14 = 0, f15 = 0, f16 = 0, f17 = 0, f18 = 0, f19 = 0, f20 = 0;
	short X,X1;
	SetColor(2, 0);
M:
	system("cls");
	cout << "\n\t\t\t\t МЕНЮ\n" << endl;

	cout << "Ваш заказ:\t\t\t Кол-во:\t\tЦена:" << endl;
	if (f1 > 0)
	{
		cout << "Суши креветка \t\t\t   " << f1 << "шт." << "\t\t\t" << s1 << " грн." << endl;
	}
	if (f2 > 0)
	{
		cout << "Суши лосось \t\t\t   " << f2 << "шт." << "\t\t\t" << s2 << " грн." << endl;
	}
	if (f3 > 0)
	{
		cout << "Суши угорь \t\t\t   " << f3 << "шт." << "\t\t\t" << s3 << " грн." << endl;
	}
	if (f4 > 0)
	{
		cout << "Суши империя \t\t\t   " << f4 << "шт." << "\t\t\t" << s4 << " грн." << endl;
	}
	if (f5 > 0)
	{
		cout << "Суши спайси краб \t\t   " << f5 << "шт." << "\t\t\t" << s5 << " грн." << endl;
	}
	if (f6 > 0)
	{
		cout << "Авокадо Маки \t\t\t   " << f6 << "шт." << "\t\t\t" << s6 << " грн." << endl;
	}
	if (f7 > 0)
	{
		cout << "Аляска \t\t\t\t   " << f7 << "шт." << "\t\t\t" << s7 << " грн." << endl;
	}
	if (f8 > 0)
	{
		cout << "Бонито Хот \t\t\t   " << f8 << "шт." << "\t\t\t" << s8 << " грн." << endl;
	}
	if (f9 > 0)
	{
		cout << "Бостон Ролл \t\t\t   " << f9 << "шт." << "\t\t\t" << s9 << " грн." << endl;
	}
	if (f10 > 0)
	{
		cout << "Вулкан \t\t\t\t   " << f10 << "шт." << "\t\t\t" << s10 << " грн." << endl;
	}
	if (f11 > 0)
	{
		cout << "Лапша гречневая с говядиной \t   " << f11 << "шт." << "\t\t\t" << s11 << " грн." << endl;
	}
	if (f12 > 0)
	{
		cout << "Лапша гречневая с курицей \t   " << f12 << "шт." << "\t\t\t" << s12 << " грн." << endl;
	}
	if (f13 > 0)
	{
		cout << "Лапша гречневая со свининой \t   " << f13 << "шт." << "\t\t\t" << s13 << " грн." << endl;
	}
	if (f14 > 0)
	{
		cout << "Лапша стеклянная с говядиной \t   " << f14 << "шт." << "\t\t\t" << s14 << " грн." << endl;
	}
	if (f15 > 0)
	{
		cout << "Лапша стеклянная с курицей \t   " << f15 << "шт." << "\t\t\t" << s15 << " грн." << endl;
	}
	if (f16 > 0)
	{
		cout << "Боржоми 0.5л\t\t\t   " << f16 << "шт." << "\t\t\t" << s16 << " грн." << endl;
	}
	if (f17 > 0)
	{
		cout << "Боржоми 0.7л\t\t\t   " << f17 << "шт." << "\t\t\t" << s17 << " грн." << endl;
	}
	if (f18 > 0)
	{
		cout << "Напитки 0.5л\t\t\t   " << f18 << "шт." << "\t\t\t" << s18 << " грн." << endl;
	}
	if (f19 > 0)
	{
		cout << "Напитки 1л\t\t\t   " << f19 << "шт." << "\t\t\t" << s19 << " грн." << endl;
	}
	if (f20 > 0)
	{
		cout << "Напитки 2л\t\t\t   " << f20 << "шт." << "\t\t\t" << s20 << " грн." << endl;
	}


	S = s1 + s2 + s3 + s4 + s5 + s6 + s7 + s8 + s9 + s10 + s11 + s12 + s13 + s14 + s15 + s16 + s17 + s18 + s19 + s20;
	SetColor(14, 0);
	cout << "\nВаш счет : " << S << " грн." << endl;

	SetColor(2, 0);
	cout << "\n\nСписок : " << endl;
	cout << "1. Суши " << endl;
	cout << "2. Роллы " << endl;
	cout << "3. Лапша" << endl;
	cout << "4. Напитки " << endl;
	cout << "5. Изменить заказ " << endl;
	cout << "6. Получить счёт " << endl;
M0:
	cin >> x;
	switch (x)
	{
	case '1':
	{	M1:
		system("cls");
		cout << "Доступные суши(1шт - 25 грамм) : \n" << endl;
		cout << "1. Суши креветка (21 грн.)" << endl;
		cout << "2. Суши лосось (18 грн.)" << endl;
		cout << "3. Суши угорь (25 грн.)" << endl;
		cout << "4. Суши империя (19 грн.)" << endl;
		cout << "5. Суши спайси краб (24 грн.)" << endl;
		cout << "6. В главное меню\n" << endl;
	Z1:
		cin >> x;
		switch (x)
		{
		case '1':
		{
			system("cls");
			cout << "1. Суши креветка (21 грн.). Сколько штук желаете?" << endl;
			cin >> f1;
			s1 = 21 * f1;
			goto M1;
		}
		case '2':
		{
			system("cls");
			cout << "2. Суши лосось (18 грн.). Сколько штук желаете?" << endl;
			cin >> f2;
			s2 = 18 * f2;
			goto M1;

		}
		case '3':
		{
			system("cls");
			cout << "3. Суши угорь (25 грн.). Сколько штук желаете?" << endl;
			cin >> f3;
			s3 = 25 * f3;
			goto M1;

		}
		case '4':
		{
			system("cls");
			cout << "4. Суши империя (19 грн.). Сколько штук желаете?" << endl;
			cin >> f4;
			s4 = 19 * f4;
			goto M1;

		}
		case '5':
		{
			system("cls");
			cout << "5. Суши спайси краб (24 грн.). Сколько штук желаете?" << endl;
			cin >> f5;
			s5 = 24 * f5;
			goto M1;

		}
		case '6':
		{
			system("cls");
			goto M;
		}
		default:
		{
			cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
			goto Z1;
		}

		}
	}
	case '2':
	{
	M2:
		system("cls");
		cout << "Доступные роллы : \n" << endl;
		cout << "1. Авокадо Маки 120 г / 6 кусочков (22 грн.)" << endl;
		cout << "2. Аляска 240 г / 8 кусочков (84 грн.)" << endl;
		cout << "3. Бонито Хот 250 г / 8 кусочков (63 грн.)" << endl;
		cout << "4. Бостон Ролл 240 г / 8 кусочков (57 грн.)" << endl;
		cout << "5. Вулкан 250 г / 8 кусочков (66 грн.)" << endl;
		cout << "6. В главное меню\n" << endl;
	Z2:
		cin >> x;
		switch (x)
		{
		case '1':
		{
			system("cls");
			cout << "1. Авокадо Маки 120 г / 6 кусочков (22 грн.). Сколько штук желаете?" << endl;
			cin >> f6;
			s6 = 22 * f6;
			goto M2;

		}
		case '2':
		{
			system("cls");
			cout << "2. Аляска 240 г / 8 кусочков (84 грн.). Сколько штук желаете?" << endl;
			cin >> f7;
			s7 = 84 * f7;
			goto M2;

		}
		case '3':
		{
			system("cls");
			cout << "3. Бонито Хот 250 г / 8 кусочков (63 грн.). Сколько штук желаете?" << endl;
			cin >> f8;
			s8 = 63 * f8;
			goto M2;

		}
		case '4':
		{
			system("cls");
			cout << "4. Бостон Ролл 240 г / 8 кусочков (57 грн.). Сколько штук желаете?" << endl;
			cin >> f9;
			s9 = 57 * f9;
			goto M2;

		}
		case '5':
		{
			system("cls");
			cout << "5. Вулкан 250 г / 8 кусочков (66 грн.). Сколько штук желаете?" << endl;
			cin >> f10;
			s10 = 66 * f10;
			goto M2;

		}
		case '6':
		{
			system("cls");
			goto M;
		}
		default:
		{
			cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
			goto Z2;
		}

		}
	}
	case '3':
	{

	M3:
		system("cls");
		cout << "Доступная лапша(все по 300г) : \n" << endl;
		cout << "1. Лапша гречневая с говядиной (59 грн.)" << endl;
		cout << "2. Лапша гречневая с курицей (55 грн.)" << endl;
		cout << "3. Лапша гречневая со свининой (58 грн.)" << endl;
		cout << "4. Лапша стеклянная с говядиной(59 грн.)" << endl;
		cout << "5. Лапша стеклянная с курицей (55 грн.)" << endl;
		cout << "6. В главное меню\n" << endl;
	Z3:
		cin >> x;
		switch (x)
		{
		case '1':
		{
			system("cls");
			cout << "1. Лапша гречневая с говядиной (59 грн.). Сколько штук желаете?" << endl;
			cin >> f11;
			s11 = 59 * f11;
			goto M3;
		}
		case '2':
		{
			system("cls");
			cout << "2. Лапша гречневая с курицей (84 грн.). Сколько штук желаете?" << endl;
			cin >> f12;
			s12 = 55 * f12;
			goto M3;

		}
		case '3':
		{
			system("cls");
			cout << "3. Лапша гречневая со свининой (58 грн.). Сколько штук желаете?" << endl;
			cin >> f13;
			s13 = 58 * f13;
			goto M3;

		}
		case '4':
		{
			system("cls");
			cout << "4. Лапша стеклянная с говядиной(59 грн.). Сколько штук желаете?" << endl;
			cin >> f14;
			s14 = 59 * f14;
			goto M3;

		}
		case '5':
		{
			system("cls");
			cout << "5. Лапша стеклянная с курицей(55 грн.). Сколько штук желаете?" << endl;
			cin >> f15;
			s15 = 55 * f15;
			goto M3;

		}
		case '6':
		{
			system("cls");
			goto M;
		}
		default:
		{
			cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
			goto Z3;
		}



		}
	case '4':
	{
	M4:
		system("cls");
		cout << "Доступные напитки : \n" << endl;
		cout << "1. Боржоми 0.5л (33 грн.)" << endl;
		cout << "2. Боржоми 0.7л (37 грн.)" << endl;
		cout << "3. Напитки 0.5л (15 грн.)" << endl;
		cout << "4. Напитки 1л(20 грн.)" << endl;
		cout << "5. Напитки 2л (27 грн.)" << endl;
		cout << "6. В главное меню\n" << endl;
	Z5:
		cin >> x;
		switch (x)
		{
		case '1':
		{
			system("cls");
			cout << "1. Боржоми 0.5л (33 грн.). Сколько штук желаете?" << endl;
			cin >> f16;
			s16 = 33 * f16;
			goto M4;
		}
		case '2':
		{
			system("cls");
			cout << "2. Боржоми 0.7л (37 грн.). Сколько штук желаете?" << endl;
			cin >> f17;
			s17 = 37 * f17;
			goto M4;

		}
		case '3':
		{
			system("cls");
			cout << "3. Напитки 0.5л (15 грн.). Сколько штук желаете?" << endl;
			cin >> f18;
			s18 = 15 * f18;
			goto M4;

		}
		case '4':
		{
			system("cls");
			cout << "4. Напитки 1л(20 грн.). Сколько штук желаете?" << endl;
			cin >> f19;
			s19 = 20 * f19;
			goto M4;

		}
		case '5':
		{
			system("cls");
			cout << "5. Напитки 2л (27 грн.). Сколько штук желаете?" << endl;
			cin >> f20;
			s20 = 27 * f20;
			goto M4;

		}
		case '6':
		{
			system("cls");
			goto M;
		}
		default:
		{
			cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
			goto Z5;
		}

		}}
	case '5':
	{

		if (S > 0)
		{
		S5:
			system("cls");
			cout << "Список заказанного : \n" << endl;
			SetColor(14, 0);
			if (f1 > 0)
			{
				cout << "1. Суши креветка (" << f1 << "шт.)" << "\t\t\t" << s1 << " грн." << endl;
			}
			if (f2 > 0)
			{
				cout << "2. Суши лосось (" << f2 << "шт.)" << "\t\t\t" << s2 << " грн." << endl;
			}
			if (f3 > 0)
			{
				cout << "3. Суши угорь (" << f3 << "шт.)" << "\t\t\t" << s3 << " грн." << endl;
			}
			if (f4 > 0)
			{
				cout << "4. Суши империя (" << f4 << "шт.)" << "\t\t\t" << s4 << " грн." << endl;
			}
			if (f5 > 0)
			{
				cout << "5. Суши спайси краб (" << f5 << "шт.)" << "\t\t\t" << s5 << " грн." << endl;
			}
			if (f6 > 0)
			{
				cout << "6. Авокадо Маки (" << f6 << "шт.)" << "\t\t\t" << s6 << " грн." << endl;
			}
			if (f7 > 0)
			{
				cout << "7. Аляска (" << f7 << "шт.)" << "\t\t\t\t" << s7 << " грн." << endl;
			}
			if (f8 > 0)
			{
				cout << "8. Бонито Хот (" << f8 << "шт.)" << "\t\t\t" << s8 << " грн." << endl;
			}
			if (f9 > 0)
			{
				cout << "9. Бостон Ролл (" << f9 << "шт.)" << "\t\t\t" << s9 << " грн." << endl;
			}
			if (f10 > 0)
			{
				cout << "10. Вулкан (" << f10 << "шт.)" << "\t\t\t\t" << s10 << " грн." << endl;
			}
			if (f11 > 0)
			{
				cout << "11. Лапша гречневая с говядиной (" << f11 << "шт.)" << "\t" << s11 << " грн." << endl;
			}
			if (f12 > 0)
			{
				cout << "12. Лапша гречневая с курицей (" << f12 << "шт.)" << "\t" << s12 << " грн." << endl;
			}
			if (f13 > 0)
			{
				cout << "13. Лапша гречневая со свининой (" << f13 << "шт.)" << "\t" << s13 << " грн." << endl;
			}
			if (f14 > 0)
			{
				cout << "14. Лапша стеклянная с говядиной (" << f14 << "шт.)" << "\t" << s14 << " грн." << endl;
			}
			if (f15 > 0)
			{
				cout << "15. Лапша стеклянная с курицей (" << f15 << "шт.)" << "\t" << s15 << " грн." << endl;
			}
			if (f16 > 0)
			{
				cout << "16. Боржоми 0.5л (" << f16 << "шт.)" << "\t\t\t" << s16 << " грн." << endl;
			}
			if (f17 > 0)
			{
				cout << "17. Боржоми 0.7л (" << f17 << "шт.)" << "\t\t\t" << s17 << " грн." << endl;
			}
			if (f18 > 0)
			{
				cout << "18. Напитки 0.5л (" << f18 << "шт.)" << "\t\t\t" << s18 << " грн." << endl;
			}
			if (f19 > 0)
			{
				cout << "19. Напитки 1л (" << f19 << "шт.)" << "\t\t\t" << s19 << " грн." << endl;
			}
			if (f20 > 0)
			{
				cout << "20. Напитки 2л (" << f20 << "шт.)" << "\t\t\t" << s20 << " грн." << endl;
			}
			S = s1 + s2 + s3 + s4 + s5 + s6 + s7 + s8 + s9 + s10 + s11 + s12 + s13 + s14 + s15 + s16 + s17 + s18 + s19 + s20;
			cout << "\nОбщая сумма заказа : " << S << "грн." << endl;
			SetColor(2, 0);
			cout << "Отредактировать - 1, обратно в меню -2" << endl;
			G3:
			cin >> x;
			switch (x)
			{
			case '1':
			{
				cout << "\nВведите номер блюда, которое хотели бы убрать." << endl;
			G:
				cin >> X;
				if (X > 0 && X <= 20)
				{

					cout << "Введите число, на которое хотите изменить количество введенного блюда" << endl;
				G1:
					cin >> X1;
					if (X1 >= 0)
					{
						switch (X)
						{
							
						case 1:
						 {
								f1 = X1;
								s1 = 21 * f1;
								goto S5;
							}
					
						case 2:
						{
							f2 = X1;
							s2 = 21 * f2;
							goto S5;
						}
						
					
						case 3:
						{
							f3 = X1;
							s3 = 21 * f3;
							goto S5;
						}
						
						case 4:
						{
							f4 = X1;
							s4 = 21 * f4;
							goto S5;
						}
						case 5:
						{
							f5 = X1;
							s5 = 21 * f5;
							goto S5;
						}
						case 6:
						{
							f6 = X1;
							s6 = 21 * f6;
							goto S5;
						}
						case 7:
						{
							f7 = X1;
							s7 = 21 * f7;
							goto S5;
						}
						case 8:
						{
							f8 = X1;
							s8 = 21 * f8;
							goto S5;
						}
						case 9:
						{
							f9 = X1;
							s9 = 21 * f9;
							goto S5;
						}
						case 10:
						{
							f10 = X1;
							s10 = 21 * f10;
							goto S5;
						}
						case 11:
						{
							f11 = X1;
							s11 = 21 * f11;
							goto S5;
						}
						case 12:
						{
							f12 = X1;
							s12 = 21 * f12;
							goto S5;
						}
						case 13:
						{
							f13 = X1;
							s13 = 21 * f13;
							goto S5;
						}
						case 14:
						{
							f14 = X1;
							s14 = 21 * f14;
							goto S5;
						}
						case 15:
						{
							f15 = X1;
							s15 = 21 * f15;
							goto S5;
						}
						case 16:
						{
							f16 = X1;
							s16 = 21 * f16;
							goto S5;
						}
						case 17:
						{
							f17 = X1;
							s17 = 21 * f17;
							goto S5;
						}
						case 18:
						{
							f18 = X1;
							s18 = 21 * f18;
							goto S5;
						}
						case 19:
						{
							f19 = X1;
							s19 = 21 * f19;
							goto S5;
						}
						case 20:
						{
							f20 = X1;
							s20 = 21 * f20;
							goto S5;
						}
							}
						
						
					
						

					}
					else
					{
						cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
						goto G1;
					}

				}
				else
				{
					cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
					goto G;
				}}
			case '2':
				goto M;
			default:
			{cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
				goto G3;
			}
		}

			
		}
			else
				cout << "\nВы еще ничего не заказали!" << endl;
			goto M0;

	}
	case '6':
	{
		if (S > 0)
		{
		S6:
			system("cls");
			cout << "\n\t\t\t\t СЧЁТ\n" << endl;
			cout << "Список заказанного : \n" << endl;
			SetColor(14, 0);
			if (f1 > 0)
			{
				cout << "Суши креветка (" << f1 << "шт.)" << "\t\t\t" << s1 << " грн." << endl;
			}
			if (f2 > 0)
			{
				cout << "Суши лосось (" << f2 << "шт.)" << "\t\t\t" << s2 << " грн." << endl;
			}
			if (f3 > 0)
			{
				cout << "Суши угорь (" << f3 << "шт.)" << "\t\t\t" << s3 << " грн." << endl;
			}
			if (f4 > 0)
			{
				cout << "Суши империя (" << f4 << "шт.)" << "\t\t\t" << s4 << " грн." << endl;
			}
			if (f5 > 0)
			{
				cout << "Суши спайси краб (" << f5 << "шт.)" << "\t\t\t" << s5 << " грн." << endl;
			}
			if (f6 > 0)
			{
				cout << "Авокадо Маки (" << f6 << "шт.)" << "\t\t\t" << s6 << " грн." << endl;
			}
			if (f7 > 0)
			{
				cout << "Аляска (" << f7 << "шт.)" << "\t\t\t\t" << s7 << " грн." << endl;
			}
			if (f8 > 0)
			{
				cout << "Бонито Хот (" << f8 << "шт.)" << "\t\t\t" << s8 << " грн." << endl;
			}
			if (f9 > 0)
			{
				cout << "Бостон Ролл (" << f9 << "шт.)" << "\t\t\t" << s9 << " грн." << endl;
			}
			if (f10 > 0)
			{
				cout << "Вулкан (" << f10 << "шт.)" << "\t\t\t\t" << s10 << " грн." << endl;
			}
			if (f11 > 0)
			{
				cout << "Лапша гречневая с говядиной (" << f11 << "шт.)" << "\t" << s11 << " грн." << endl;
			}
			if (f12 > 0)
			{
				cout << "Лапша гречневая с курицей (" << f12 << "шт.)" << "\t" << s12 << " грн." << endl;
			}
			if (f13 > 0)
			{
				cout << "Лапша гречневая со свининой (" << f13 << "шт.)" << "\t" << s13 << " грн." << endl;
			}
			if (f14 > 0)
			{
				cout << "Лапша стеклянная с говядиной (" << f14 << "шт.)" << "\t" << s14 << " грн." << endl;
			}
			if (f15 > 0)
			{
				cout << "Лапша стеклянная с курицей (" << f15 << "шт.)" << "\t" << s15 << " грн." << endl;
			}
			if (f16 > 0)
			{
				cout << "Боржоми 0.5л (" << f16 << "шт.)" << "\t\t\t" << s16 << " грн." << endl;
			}
			if (f17 > 0)
			{
				cout << "Боржоми 0.7л (" << f17 << "шт.)" << "\t\t\t" << s17 << " грн." << endl;
			}
			if (f18 > 0)
			{
				cout << "Напитки 0.5л (" << f18 << "шт.)" << "\t\t\t" << s18 << " грн." << endl;
			}
			if (f19 > 0)
			{
				cout << "Напитки 1л (" << f19 << "шт.)" << "\t\t\t" << s19 << " грн." << endl;
			}
			if (f20 > 0)
			{
				cout << "Напитки 2л (" << f20 << "шт.)" << "\t\t\t" << s20 << " грн." << endl;
			}
			SetColor(2, 0);
			cout << "\nОбщая сумма заказа : " << S << "грн." << endl;
			cout << "\nПодтвердите заказ.(1 - подтвердить, 2 - отменить, 3 - назад)" << endl;
		S1:
			cin >> X;
			if (X == 1)
			{
				system("cls");
				SetColor(14, 0);
				cout << "\nВаш заказ успешно офрмлен! " << endl;
				cout << "Ждем вас с новыми заказами !\n" << endl;
				SetColor(2, 0);
				break;
			}
			else if (X == 2)
			{
				cout << "Заказ отменен. (1 - вернуться в меню, 2 - выйти, 3 - назад)" << endl;
			S2:
				cin >> X;
				if (X == 1)
				{
					goto START;
				}
				else if (X == 2)
				{
					break;
				}
				else if (X == 3)
				{
					goto S6;
				}
				else
				{
					cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
					goto S2;
				}
			}
			else if (X == 3)
			{
				goto M;
			}
			else
			{
				cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
				goto S1;
			}


		}
		else
			cout << "\nВы еще ничего не заказали!" << endl;
		goto M0;

		break;
	}


	default:
	{
		cout << "Неккоректный символ! Попробуйте еще раз!" << endl;
		goto M0;
	}

	}

	cout << "\n" << endl;
	}

}