#include <iostream>
#include <cmath>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	//Задание 1

	//double x1 = 0, y1 = 0;//A
	//double x2, y2, x3, y3;//B, C
	//cout << "Введите координату X для B : ";
	//cin >> x2;
	//cout << "Введите координату Y для B : ";
	//cin >> y2;
	//cout << "Введите координату X для C : ";
	//cin >> x3;
	//cout << "Введите координату Y для C : ";
	//cin >> y3;
	//if (x1 == x2)
	//{
	//	if (x1 == x3)
	//		cout << "Точка С принадлежит прямой AB" << endl;
	//	else
	//		cout << "Точка С не принадлежит прямой AB" << endl;
	//}
	//else
	//{
	//	double a, b;
	//	a = (y1 - y2) / (x1 - x2);
	//	b = y1 - a*x1;
	//	if (a*x3 + b == y3)
	//		cout << "Точка С принадлежит прямой AB" << endl;
	//	else
	//		cout << "Точка С не принадлежит прямой AB" << endl;
	//}


	//Задание 2
	
	/*double a, b, x, y, c;
	cout << "Введите число A : ";
	cin >> a;
	cout << "Введите число B : ";
	cin >> b;
	c = sqrt(pow(a, 2) + pow(b, 4));
	x = pow(cos(a), 2) + pow(sin(c), 2);
	y = pow(x, 2) + pow(abs(x), 1.0 / 3);
	cout << "y = " << y << endl;
	cout << "x = " << x << endl;
	cout << "c = " << c << endl;*/

	return 0;
}